## Plan Result (aat_global)




<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;tax-tribunals-datacapture&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;help-with-fees-publicapp&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;help-with-fees-staffapp&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["tax-tribunals-datacapture"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/frontendEndpoints/tax-tribunals-datacapture"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["help-with-fees-publicapp"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/helpwithfeespublicappaat"
        name                              = "helpwithfeespublicappaat"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (6 unchanged attributes hidden)

      ~ managed_rule {
            # (2 unchanged attributes hidden)

          ~ exclusion {
              ~ selector       = "_app_session" -> "_hwf-publicapp_session"
                # (2 unchanged attributes hidden)
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_ga"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gat"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gid"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["help-with-fees-staffapp"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/helpwithfeesstaffappaat"
        name                              = "helpwithfeesstaffappaat"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (6 unchanged attributes hidden)

      ~ managed_rule {
            # (2 unchanged attributes hidden)

          ~ exclusion {
              ~ selector       = "_app_session" -> "_fr-staffapp_session"
                # (2 unchanged attributes hidden)
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_ga"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gat"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gid"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "fr_username"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "homepage_visited_timestamp"
            }

            # (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1729,"Program":"tfcmt","SHA1":"","Target":"aat_global","Vars":{}} -->